# Homebrew packages for macOS

# Core tools. git/vim/zsh stay brew-managed for bootstrap (needed before
# Nix/home-manager activates; their binaries aren't Nix-managed yet). The modern
# CLI replacements (bat, eza, delta, duf, zoxide, direnv, starship, tldr, gh,
# ripgrep, fd, fzf, jq, tree, htop, btop, mosh, entr, chafa, cloc, git-lfs) are
# now provided by home-manager and removed from here.
brew "git"
brew "vim"
brew "curl"
brew "wget"
brew "watch"
brew "p7zip"
brew "qrencode"

# Formatters & linters
brew "gitleaks"
brew "shfmt"
brew "shellcheck"
brew "typos-cli"
brew "taplo"
brew "yamlfmt"
brew "clang-format"
brew "cmake"

# Development
brew "mise"
brew "imagemagick"
brew "aria2"
brew "rclone"
brew "redis"
brew "pandoc"
brew "exiftool"
brew "gifsicle"
brew "ocrmypdf"
brew "poppler"
brew "pdfly"
brew "signal-cli"

# Language tooling
brew "eslint"
brew "typescript-language-server"
brew "zig"

# Cloud / infra
brew "awscli"
brew "flyctl"

# AI tools
cask "codex"
cask "lm-studio"

# Fonts
cask "font-jetbrains-mono-nerd-font"

# Security
cask "secretive"

# Shell
brew "zsh"
brew "zsh-completions"

# Taps
tap "anomalyco/tap"
tap "turbot/tap"
brew "steampipe"
