# Homebrew packages for macOS

# Core tools
brew "git"
brew "vim"
brew "curl"
brew "wget"
brew "jq"
brew "tree"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "htop"
brew "btop"

# Modern CLI replacements
brew "bat"
brew "eza"
brew "delta"
brew "duf"
brew "zoxide"
brew "direnv"
brew "starship"
brew "tldr"

# Development
brew "gh"
brew "node"
brew "python"
brew "shellcheck"
brew "tmux"

# Shell
brew "zsh"
brew "zsh-completions"
