# Homebrew packages for macOS

# Core tools
brew "git"
brew "git-lfs"
brew "vim"
brew "curl"
brew "wget"
brew "jq"
brew "tree"
brew "ripgrep"
brew "fd"
brew "fzf"
brew "htop"
brew "btop"
brew "watch"
brew "p7zip"

# Modern CLI replacements
brew "bat"
brew "eza"
brew "delta"
brew "duf"
brew "zoxide"
brew "direnv"
brew "starship"
brew "tldr"

# Formatters & linters
brew "shfmt"
brew "shellcheck"
brew "typos-cli"
brew "taplo"
brew "yamlfmt"
brew "clang-format"
brew "cmake"

# Development
brew "gh"
brew "mise"
brew "tmux"
brew "imagemagick"
brew "aria2"
brew "rclone"
brew "redis"
brew "pandoc"
brew "exiftool"
brew "gifsicle"
brew "ocrmypdf"
brew "poppler"
brew "pdfly"

# Language tooling
brew "eslint"
brew "typescript-language-server"
brew "zig"

# Cloud / infra
brew "awscli"
brew "flyctl"
brew "codex"

# Shell
brew "zsh"
brew "zsh-completions"

# Taps
tap "turbot/tap"
brew "steampipe"
